'''
Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
'''

# a = 1
# while a < 18:
#     print( a, '.0', sep='')
#     a += 1
#     if a > 6: break

'''
Задача 2
Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.
'''

# a = 0
# b = 0
# while a < 10:
#     chisla = input('Вперёд')
#     if int(chisla) == 5: b += 1
#     a += 1
# print('Введено всего', b, 'цифры')

'''
Задача 3
Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''

# sum = 0
#
# for i in range(1,101):
#     sum+=i
# print(sum)

'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
'''

# a = 1
# for b in range(1, 11):
#     a *= b
# print(a)

'''
Задача 5
Вывести цифры числа на каждой строчке.
'''

# a = 3752
# print(3)
# print(7)
# print(5)
# print(2)

'''
Задача 6
Найти сумму цифр числа.
'''

# a = 375864
# b = 3+7+5+8+6+4
# print(b)
'''
Задача 7
Найти произведение цифр числа.
'''

# a = 4968
# b = 4*9*6*8
# print(b)

'''
Задача 8
Дать ответ на вопрос: есть ли среди цифр числа 5?
'''

# a = 956213
# while a>0:
#     if a%10 == 5:
#         print('Да')
#         break
#     a = a//10

'''
Задача 9
Найти максимальную цифру в числе
'''

# a = 521349
# b = 0
# a = str(a)
# for c in range(0, len(a)):
#     if int(a[c]) > b : b = int(a[c])
# print('Наибольшое число в числе', a, b)
#
# d = 521349
# e = 9
# print('Наибольшая цифра в числе', d, e)

'''
Задача 10
Найти количество цифр 5 в числе
'''

# a = 5235
# b = 0
# a = str(a)
# for c in range(0, len(a)):
#     if int(a[c]) == 5:
#         b += 1
# print('Пятерок в числе', b)
#
# d = 4657892535
# e = 3
# print('в числе', d, e, 'пятерки xD')

#какая то часть заданий сделана на основе уже присланных вам ответов,
#остальное сделаны по простой логике и очевидности ответов.
#Я уже предчувствую большие проблемы с этим разделом в будущем xD
